#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/devops-llabbe/crud-app-terraform/runs/run-29oj2fWU35jCGmgy

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
tls_private_key.private: Refreshing state... [id=1500691685c47d3f2105d23f4c80cef003a7621e]
aws_iam_role.codedeploy-role: Refreshing state... [id=CODEDEPLOY-ROLE]
aws_vpc.prod-vpc: Refreshing state... [id=vpc-0799ddcd6278a8a47]
aws_key_pair.key_pair: Refreshing state... [id=my-key]
aws_iam_role.deploy-ec2-role: Refreshing state... [id=DEPLOY-EC2-SERVICE-ROLE]
aws_codedeploy_deployment_config.deployment-config-ec2: Refreshing state... [id=FRONT_DC]
aws_codedeploy_app.crud_app: Refreshing state... [id=9dc8b868-eae7-49ee-b7c5-7a2d821bb1b9:CRUD_APP]
aws_iam_instance_profile.ec2-profile: Refreshing state... [id=EC2_CODEDEPLOY_PROFILE]
aws_iam_role_policy_attachment.policy-ec2-codedeploy: Refreshing state... [id=DEPLOY-EC2-SERVICE-ROLE-20220312221928893700000003]
aws_iam_role_policy_attachment.policy-codedeploy: Refreshing state... [id=CODEDEPLOY-ROLE-20220312221928895400000004]
aws_iam_role_policy_attachment.policy-codedeploy-faccess: Refreshing state... [id=CODEDEPLOY-ROLE-20220312221928886500000001]
aws_iam_role_policy_attachment.policy-ec2-faccess: Refreshing state... [id=CODEDEPLOY-ROLE-20220312221928890900000002]
aws_codedeploy_deployment_group.deployment-group-ec2: Refreshing state... [id=fe4339c2-4867-4752-b366-673972e8e934]
aws_subnet.private-subnet: Refreshing state... [id=subnet-08c9c0197d058f655]
aws_subnet.public-subnet: Refreshing state... [id=subnet-08fe707c9e1b9c573]
aws_internet_gateway.gateway: Refreshing state... [id=igw-054983b55b7f8fa9f]
aws_security_group.sg-db: Refreshing state... [id=sg-07d51064379a734f2]
aws_security_group.sg-web: Refreshing state... [id=sg-06174418e8db878b0]
aws_eip.eip-nat: Refreshing state... [id=eipalloc-0e6cd5bf7d53e07e5]
aws_route_table.route-table-web: Refreshing state... [id=rtb-0698ce6241fb33aa6]
aws_network_interface.network-web: Refreshing state... [id=eni-0382fc0ee478ef475]
aws_route_table_association.rta-web: Refreshing state... [id=rtbassoc-0cb9c02e3e01d5d16]
aws_nat_gateway.public-nat: Refreshing state... [id=nat-03c7bc736e57f97f7]
aws_instance.web_server: Refreshing state... [id=i-027fe6f02eecf0b2d]
aws_route_table.route-table-db: Refreshing state... [id=rtb-023926ee44a9a928a]
aws_instance.db_server: Refreshing state... [id=i-0ba8f065c986937d1]
aws_route_table_association.rta-db: Refreshing state... [id=rtbassoc-034b6d46edc7f153a]
aws_eip.eip-web: Refreshing state... [id=eipalloc-06a52d2d6a4a53743]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_eip.eip-web has changed
  ~ resource "aws_eip" "eip-web" {
        id                   = "eipalloc-06a52d2d6a4a53743"
      + tags                 = {}
        # (13 unchanged attributes hidden)
    }

  # aws_instance.web_server has changed
  ~ resource "aws_instance" "web_server" {
        id                                   = "i-027fe6f02eecf0b2d"
      ~ public_dns                           = "ec2-35-180-190-174.eu-west-3.compute.amazonaws.com" -> "ec2-52-47-62-223.eu-west-3.compute.amazonaws.com"
      ~ public_ip                            = "35.180.190.174" -> "52.47.62.223"
        tags                                 = {
            "Environment" = "production"
            "Name"        = "production-web-server"
        }
        # (29 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }

  # aws_key_pair.key_pair has changed
  ~ resource "aws_key_pair" "key_pair" {
        id          = "my-key"
      + tags        = {}
        # (6 unchanged attributes hidden)
    }

  # aws_network_interface.network-web has changed
  ~ resource "aws_network_interface" "network-web" {
        id                        = "eni-0382fc0ee478ef475"
        tags                      = {}
        # (22 unchanged attributes hidden)

      + attachment {
          + attachment_id = "eni-attach-058093ca7cb7148ea"
          + device_index  = 0
          + instance      = "i-027fe6f02eecf0b2d"
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.eip-web will be updated in-place
  ~ resource "aws_eip" "eip-web" {
        id                   = "eipalloc-06a52d2d6a4a53743"
      ~ instance             = "i-027fe6f02eecf0b2d" -> (known after apply)
        tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # aws_instance.db_server must be replaced
-/+ resource "aws_instance" "db_server" {
      ~ arn                                  = "arn:aws:ec2:eu-west-3:707771957544:instance/i-0ba8f065c986937d1" -> (known after apply)
      ~ availability_zone                    = "eu-west-3b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0ba8f065c986937d1" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ key_name                             = "my-key" -> (known after apply) # forces replacement
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0267e4331a64c8e79" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-50.eu-west-3.compute.internal" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Environment" = "production"
            "Name"        = "production-db-server"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "12862898bb00641689ccde3b7c1cfb6e545fb1cc" -> "00215eaadaffcbfbe818e4310e6aa5829dc21b25" # forces replacement
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-04fb7e2b477de162b" -> (known after apply)
          ~ volume_size           = 10 -> (known after apply)
          ~ volume_type           = "gp3" -> (known after apply)
        }
    }

  # aws_instance.web_server must be replaced
-/+ resource "aws_instance" "web_server" {
      ~ arn                                  = "arn:aws:ec2:eu-west-3:707771957544:instance/i-027fe6f02eecf0b2d" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "eu-west-3c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-027fe6f02eecf0b2d" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ key_name                             = "my-key" -> (known after apply) # forces replacement
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0382fc0ee478ef475" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-50.eu-west-3.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.50" -> (known after apply)
      ~ public_dns                           = "ec2-52-47-62-223.eu-west-3.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "52.47.62.223" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - source_dest_check                    = true -> null
      ~ subnet_id                            = "subnet-08fe707c9e1b9c573" -> (known after apply)
        tags                                 = {
            "Environment" = "production"
            "Name"        = "production-web-server"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "e7c046132f168f28ebd56d2709cff70863934b37" -> "6b62ea4072c54f116339b669e6b5740fd2c1e6e6" # forces replacement
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-06174418e8db878b0",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-0b72ea7c7cc32f664" -> (known after apply)
          ~ volume_size           = 10 -> (known after apply)
          ~ volume_type           = "gp3" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_key_pair.key_pair must be replaced
-/+ resource "aws_key_pair" "key_pair" {
      ~ arn             = "arn:aws:ec2:eu-west-3:707771957544:key-pair/my-key" -> (known after apply)
      ~ fingerprint     = "32:29:58:05:29:da:5f:f0:9d:8d:5f:9d:e1:77:ec:47" -> (known after apply)
      ~ id              = "my-key" -> (known after apply)
      ~ key_name        = "my-key" -> "ec2-bastion-key" # forces replacement
      + key_name_prefix = (known after apply)
      ~ key_pair_id     = "key-0195f72009cd2e250" -> (known after apply)
      ~ public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCj/ceymfo1j3PcKW3bOTfM/7syQfadu7B0sCIul1lnx040hR7+ndu9O/h9Xlf+eVeg2xDcb8brmHHOCW5EZIE/mI5IfT7BCUBQyLf0lxGYb4S0LjiZ8N1jR8rZhahXd231k7ahJgVacTeOwwMQ5F5+a3P0wps9sJhDp8gddJjgxS7tGeupNRsxIwcNtK1oJLqN9kTXtKLEaa1bK3gnFM7htTKvKDeweNW6O4jS700oyevyCjjJ8/YnxQXg2r0LpxrX2h0GUM+utNOMLvk5Ve1I9RqYDzqGtMr7T6k4Q4PwAqZ9TTjYk+EHg/d9jcNb0LGhbDBy5PvzM32384usdip9ykC4+h5jcjpzVOc+s37UuEwlBdigrrzQogcUXszSZdb0pv0aXon8Zlinb7zNT2YYVeZrhudLM9RHfOaQHgc0TteXY50oz0aRNK5pPgUSJVfaS4PcFqh5EzLD32dRgykaU3YAKGz5y1pHVGr3yOAm2PO43E2hfVQqZOJjC2dX1qt/dlkOsaxJ6pukVtKzamARt8/6PNYiWDQi1ZelS3RYeJ/NL6jkboj5NEKtXKJcZ5KyVtW3NktusrWunrKBZFTlj8Yc0McCn6R6OkXbZ2b8dCl9WkbET/yG5y8GgosytDfzqONHpb21luds9Zp0h1zAsRxjRNb/9ja6s5knuYCj5w==" -> (known after apply) # forces replacement
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
    }

  # tls_private_key.id_rsa will be created
  + resource "tls_private_key" "id_rsa" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 4096
    }

  # tls_private_key.private will be destroyed
  # (because tls_private_key.private is not in configuration)
  - resource "tls_private_key" "private" {
      - algorithm                  = "RSA" -> null
      - ecdsa_curve                = "P224" -> null
      - id                         = "1500691685c47d3f2105d23f4c80cef003a7621e" -> null
      - private_key_pem            = (sensitive value)
      - public_key_fingerprint_md5 = "03:32:54:28:f7:4c:31:4b:05:df:c3:ca:c7:73:8c:53" -> null
      - public_key_openssh         = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCj/ceymfo1j3PcKW3bOTfM/7syQfadu7B0sCIul1lnx040hR7+ndu9O/h9Xlf+eVeg2xDcb8brmHHOCW5EZIE/mI5IfT7BCUBQyLf0lxGYb4S0LjiZ8N1jR8rZhahXd231k7ahJgVacTeOwwMQ5F5+a3P0wps9sJhDp8gddJjgxS7tGeupNRsxIwcNtK1oJLqN9kTXtKLEaa1bK3gnFM7htTKvKDeweNW6O4jS700oyevyCjjJ8/YnxQXg2r0LpxrX2h0GUM+utNOMLvk5Ve1I9RqYDzqGtMr7T6k4Q4PwAqZ9TTjYk+EHg/d9jcNb0LGhbDBy5PvzM32384usdip9ykC4+h5jcjpzVOc+s37UuEwlBdigrrzQogcUXszSZdb0pv0aXon8Zlinb7zNT2YYVeZrhudLM9RHfOaQHgc0TteXY50oz0aRNK5pPgUSJVfaS4PcFqh5EzLD32dRgykaU3YAKGz5y1pHVGr3yOAm2PO43E2hfVQqZOJjC2dX1qt/dlkOsaxJ6pukVtKzamARt8/6PNYiWDQi1ZelS3RYeJ/NL6jkboj5NEKtXKJcZ5KyVtW3NktusrWunrKBZFTlj8Yc0McCn6R6OkXbZ2b8dCl9WkbET/yG5y8GgosytDfzqONHpb21luds9Zp0h1zAsRxjRNb/9ja6s5knuYCj5w==
        EOT -> null
      - public_key_pem             = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAo/3Hspn6NY9z3Clt2zk3
            zP+7MkH2nbuwdLAiLpdZZ8dONIUe/p3bvTv4fV5X/nlXoNsQ3G/G65hxzgluRGSB
            P5iOSH0+wQlAUMi39JcRmG+EtC44mfDdY0fK2YWoV3dt9ZO2oSYFWnE3jsMDEORe
            fmtz9MKbPbCYQ6fIHXSY4MUu7RnrqTUbMSMHDbStaCS6jfZE17SixGmtWyt4JxTO
            4bUyryg3sHjVujuI0u9NKMnr8go4yfP2J8UF4Nq9C6ca19odBlDPrrTTjC75OVXt
            SPUamA86hrTK+0+pOEOD8AKmfU042JPhB4P3fY3DW9CxoWwwcuT78zN9t/OLrHYq
            fcpAuPoeY3I6c1TnPrN+1LhMJQXYoK680KIHFF7M0mXW9Kb9Gl6J/GZYp2+8zU9m
            GFXma4bnSzPUR3zmkB4HNE7Xl2OdKM9GkTSuaT4FEiVX2kuD3BaoeRMyw99nUYMp
            GlN2AChs+ctaR1Rq98jgJtjzuNxNoX1UKmTiYwtnV9arf3ZZDrGsSeqbpFbSs2pg
            EbfP+jzWIlg0ItWXpUt0WHifzS+o5G6I+TRCrVyiXGeSslbVtzZLbrK1rp6ygWRU
            5Y/GHNDHAp+kejpF22dm/HQpfVpGxE/8hucvBoKLMrQ386jjR6W9tZbnbPWadIdc
            wLEcY0TW//Y2urOZJ7mAo+cCAwEAAQ==
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                   = 4096 -> null
    }

Plan: 4 to add, 1 to change, 4 to destroy.


```

</details>

*Pusher: @gajetto, Action: `pull_request`*